{
   "title": "Church Membership",
   "ideas": [
      {
         "heading": "How do you define it?",
         "subideas": [
            {
               "text": "Biblical membership, is the explicit limitation, of pertinent eclesiological duties and privileges, to biblical gospel believing members, of biblical local congregations, that are explicitly commited to obeying, the biblical mandates about the local church, specifically with the members and leadership of their congregation"
            }
         ]
      },
      {
         "heading": "How do you practice it?",
         "subideas": [
            {
               "text": "We limit all eclesiological duties and privileges, to individuals validated by our current leadership, as biblical gospel believers and members of a local church"
            },
            {
               "text": "This is to say, that we limit, all spiritual gift exercise, all ministry part-taking, all eclesiological duties responsibility, and all eclesiological privileges, to individuals recognized as current members of a biblical local church, by our current leadership"
            }
         ]
      },
      {
         "heading": "Which eclesiological duties and privileges?",
         "subideas": [
            {
               "text": "1. Love God above all (mat.22, ap.2.1-7)"
            },
            {
               "text": "1. Preserve each other from apostasy (mat.18, stg.5.19-20, gal.6.1-5, 1.cor.5, heb.10.23-31, 1.tes.5.14)"
            },
            {
               "text": "2. Protect the holyness of the church (mat.21.12-13, 1.cor.5, tit.2.3-5, ap.2.12-18)"
            },
            {
               "text": "3. Protect the biblical doctrine (1.tim.3.14-15, rom.16.17-20, gal.3.1-5, ap.2.12-18)"
            },
            {
               "text": "4. Learn and teach biblical doctrine in community (rom.14-15 ,Ef.3.14-19, 4.11-16)"
            },
            {
               "text": "6. Advance the gospel as a body (Fil.1.27, fil.2.1-2, 1.cor.9, rom.10., 3.jn)"
            },
            {
               "text": "7. Build the church through spiritual gift's and ministry exercise (rom.12., ef.5, 1.cor.12-14, ef.5.17, col.3.16, )"
            },
            {
               "text": "8. Live as the family of God (Ef.4.1-4, col.3.5-17, stg.5.14-16, fil.2.1-10)"
            },
            {
               "text": "9. Respond to biblical leadership (1.Tes.5, 1.tim.3, 1.ped.5, heb.13.17, 1.tim.5)"
            },
            {
               "text": "10. Remember the Lord's sacrifice through the Lord's Supper (1.cor.11.17-34)"
            }
         ]
      },
      {
         "heading": "Is this practice biblical?",
         "subideas": [
            {
               "text": "It's impossible to obey the following biblical mandates in the contemporary times without it."
            }
         ]
      },
      {
         "heading": "How does this impact's loving all believers?",
         "subideas": [
            {
               "text": "We recognize our duty of loving and having comunión with all believers. Col.1.3-5, Rom.16.1-16"
            },
            {
               "text": "Therefore, we try to obey and enjoy all the inter-eclesial biblical duties and privileges. 1.cor.16"
            },
            {
               "text": "Nonetheless, we also recognize that we require limit's to keep the eclesiological biblical mandates as discussed before, therefore, we aim to keep both, the intra and inter eclesial duties and privileges with this principle:"
            },
            {
               "text": "Comunion with all biblical churches, collaboration by afinity and leadership determined benefit"
            },
            {
               "text": "This is to say that we ought to have a christian loving and truth centered comunion with all believers, but must collaborate in ministry with them judiciously, analizing each oportunity, and partaking only in activities that adorn the gospel and preverve holyness and doctrine"
            }
         ]
      }
   ]
}