{
   "title": "Responding to God's severe discipline",
   "introduction_ideas": [
      {
         "text": "Moses has taken the people to the promised land."
      },
      {
         "text": "The journey took 40 years."
      },
      {
         "text": "Now he'll explain the law before they enter."
      },
      {
         "text": "He remembers them God's promise of the land, and encourages them to take the land."
      },
      {
         "text": "Then, Moses begin to recapitulate key aspects of the journey to the promised land."
      },
      {
         "text": "First he speaks about the leadership that God provided to aid Moses and serve the people."
      },
      {
         "text": "Then, he lengthly recapitulates their fathers sin of incredulity on God power to give them the Land."
      },
      {
         "text": "Israel begin to Murmur, and forgot God goodness saying that he planned to kill them by the Amorites."
      },
      {
         "text": "The passage says that Israel rebeled against God's commandment of taking the land."
      },
      {
         "text": "Even with this, God gave them his word throguh Moses to remember them the He would fight for them."
      },
      {
         "text": "But they wouldn't listen event knowing that God guided them toward places to camp through the night fire and the cloud on each day."
      },
      {
         "text": "Here we arrive to our passage."
      }
   ],
   "ideas": [
      {
         "heading": "God disciplines his children when they sin",
         "subideas": [
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "The persistant incredulity and rebelion of Israel was punished with the privation of the promised land",
                     "biblicalReferences": [
                        "Deut.1.34-40"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "Some disciplinary consecuences were collective, others individual",
                     "biblicalReferences": [
                        "Deut.1.34-36"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "Generally God's discipline touches all, independantly of the visibility of the believer (there are some exceptions like David and Solomon)",
                     "biblicalReferences": [
                        "Deut.1.37-38"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "God's discipline, even when severe, is a marvelous saving gift for his children",
                     "biblicalReferences": [
                        "Heb.12.5-13"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "God's discipline is only poored over the true believers of this church, false believers are just judged and hardened for their condemnation",
                     "biblicalReferences": [
                        "Heb.3.12-19",
                        "Rom.1.24"
                     ]
                  }
               ]
            }
         ]
      },


      {
         "heading": "Sometimes, God's discipline seems severe",
         "subideas": [
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "After going through the desert, and passing all the crisis in the previous disciplinary moment, the returning to the desert to wander by years until all the generation is dead, seems to be too much",
                     "biblicalReferences": [
                        "Deut.1.34-35","Num.14.32-35"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "Even leaving Moses out because he got angry against the people and expressed his anger sinfully, seems to be exagerated",
                     "biblicalReferences": [
                        "Deut.1.37"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "Also the death of Usa, the death of the prophet that confronted the king, the death of Ananiah and Safirah, and other cases, seem to be exagerated, but are the just administration of God",
                     "biblicalReferences": [
                        "1.Sam.",
                        "1.Cor.11.17-33"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "We see this actions exagerated because we see our sin lightly. If we believe that the sin of the litle ones will be retibuted with an eternal torture in the lake of fire, we'll surely believe that severe discipline is a likely and even gracious action of God before our sin.",
                     "biblicalReferences": [
                        "Luc.13.1-5",
                        "ap.20.11-15"
                     ]
                  }
               ]
            }
         ]
      },
      {
         "heading": "Resistance against this discipline entails further consecuences",
         "subideas": [
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "Israel reacted to the removal of benefits of the discipline with an wrong interested obedience.",
                     "biblicalReferences": [
                        "Deut.1.41-46"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "God warned them that this action would entail further consecuences.",
                     "biblicalReferences": [
                        "Deut.1.41-46"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "Some Israelites were sliced and traspased until death because of the rebelion and the army was strepitously defeated.",
                     "biblicalReferences": [
                        "Num.14.45"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "They didn't even received consolation from God.",
                     "biblicalReferences": [
                        "Deut.1.45"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "The consecuences of this severe discipline were established until they died and they even had to remain emotionally wounded in passivity for \"many days\".",
                     "biblicalReferences": [
                        "Deut.1.46"
                     ]
                  }
               ]
            }
         ]
      },


      {
         "heading": "God's is achieving his plan even with the seemingly contradictory consecuences of discipline",
         "subideas": [
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "God removed the benefits of His promise to the severely disciplined generation without violating his promised terms.",
                     "biblicalReferences": [
                        "Deut.1.34-40"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "God can assign surprissingly great consecuences event to the seemingly key persons of this people and still achieve his purpose.",
                     "biblicalReferences": [
                        "Deut.1.37-38"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "The purpose of God is to save his elect. Therefore, he can destroy as many leaders and churches as He seems fit, and even condemm entire generations and still achieve His plan of redeeming the elect.",
                     "biblicalReferences": [
                        "2.tim.2.10","1.Cor.1.22-24","Mat.11.20.24","Jn.6.38-40"
                     ]
                  }
               ]
            }
         ]
      },



      {
         "heading": "God given duties remain even in the presence of severe disciplinary consecuences",
         "subideas": [
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "The fact that God can assing painful consecuences in his discipline, doesn't removes any of His corresponding duties for us.",
                     "biblicalReferences": [
                        "Deut.1.41-43","Num.31.1"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "Even when we then to think that before the painful consecuences of discipline God will remove some duties, that's not the case.",
                     "biblicalReferences": [
                        "Lev.10.1-7","Num.16.41-45"
                     ]
                  }
               ]
            }
         ]
      },



      {
         "heading": "Our hearts can become bitter because of severe discipline",
         "subideas": [
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "The israelites got bitter agains God after some of His judgements.",
                     "biblicalReferences": [
                        "Num.16.3","Num.16.41-45"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "We examine our hearts and flee and help other to flee from bitternes and apostasy.",
                     "biblicalReferences": [
                        "Heb.12.14-17"
                     ]
                  }
               ]
            }
         ]
      },



      {
         "heading": "We must humbly accept God's discipline and resist bitterness by renewing our minds with scripture",
         "subideas": [
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "The Old Testamet was written to teach us to avoid this sin's of Israel that we are also likely to commit.",
                     "biblicalReferences": [
                        "1.Cor.10.1-13","Rom.12.1-2"
                     ]
                  }
               ]
            },
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "The Old Testamet was written to teach us to avoid this sin's of Israel that we are also likely to commit.",
                     "biblicalReferences": [
                        "1.Cor.10.1-13","Rom.12.1-2"
                     ]
                  }
               ]
            }
         ]
      },



      {
         "heading": "We must joyfully obey God's commandments embracing his disciplinary consecuences",
         "subideas": [
            {
               "isBiblicallyJustifiedIdeaList": true,
               "biblicallyJustifiedIdeaList": [
                  {
                     "text": "Love God above all",
                     "biblicalReferences": [
                        "mat.22",
                        "ap.2.1-7"
                     ]
                  }
               ]
            }
         ]
      },
      {
         "heading": "Live for eternity, where all disciplinary and general sufering is removed, helps us to persevere",
         "subideas": [
            {
               "text": "We recognize our duty of loving and having comunión with all believers. Jn.17.17, Col.1.3-5, Rom.16.1-16"
            },
            {
               "text": "Therefore, we try to obey and enjoy all the inter-eclesial biblical duties and privileges. 1.cor.16"
            },
            {
               "text": "Nonetheless, we also recognize that we require limit's to keep the eclesiological biblical mandates as discussed before, therefore, we aim to keep both, the intra and inter eclesial duties and privileges with this principle:"
            },
            {
               "text": "Comunion with all biblical churches, collaboration by afinity and leadership determined benefit"
            },
            {
               "text": "This is to say that we ought to have a christian loving and truth centered comunion with all believers, but must collaborate in ministry with them judiciously, analizing each oportunity, and partaking only in activities that adorn the gospel and preverve holyness and doctrine"
            }
         ]
      }
   ]
}